;------------------------------------------------------------------------------
;3. Определите функционал (APL-APPLY f x), который применяет каждую функцию fi-
;   списка (f1 f2 ... fn) к соответствующему элементу списка x = (x1 x2 ... xn)
;   и возвращает список, сформированный из результатов.  ----------------------

(defun apl-apply (f x)
    (mapcar (lambda(f x) (funcall f x)) f x)
)

(print '(test 3))
(defun f1 (x) (* x 1))
(defun f2 (x) (* x 2))
(defun f3 (x) (* x 3))
(defun f4 (x) (* x 4))
(defun f5 (x) (* x 5))

(print (apl-apply '(f1 f2 f3 f4 f5) '(1 2 3 4 5)))